In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('salaries_by_college_major.csv')
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [3]:
print(df.columns)
print(df.size)

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')
306

In [4]:
dfm=df[df.isna().any(axis=1)]
dfm

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [5]:
df=df.dropna()
print(df.size)

300

In [6]:
print(df['Starting Median Salary'].idxmax())
df.loc[43]

43

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [7]:
dfc=df.loc[df['Mid-Career Median Salary'].idxmax(),['Undergraduate Major','Mid-Career Median Salary']]
dfc

Undergraduate Major         Chemical Engineering
Mid-Career Median Salary                107000.0
Name: 8, dtype: object

In [8]:
dfc1=df.loc[df['Starting Median Salary'].idxmin(),['Starting Median Salary','Undergraduate Major']]
dfc1

Starting Median Salary    34000.0
Undergraduate Major       Spanish
Name: 49, dtype: object

In [9]:
dfc2=df.loc[df['Mid-Career Median Salary'].idxmin(),'Starting Median Salary']
dfc2

34900.0

In [10]:
#adding a new column on the basis of two columns here
spread_col=df['Mid-Career 90th Percentile Salary'].subtract(df['Mid-Career 10th Percentile Salary'])
df.insert(2,"spread_midC",spread_col)
df.head()

,Undergraduate Major,Starting Median Salary,spread_midC,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,109800.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,96700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,113700.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,104200.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,85400.0,76800.0,50600.0,136000.0,Business

In [11]:
low_ach=df.sort_values('spread_midC')
low_ach[['Undergraduate Major','Group']].head()

           Undergraduate Major     Group
40                     Nursing  Business
43         Physician Assistant      STEM
41                   Nutrition      HASS
49                     Spanish      HASS
27  Health Care Administration  Business

In [13]:
sorted_df1=df.sort_values('Mid-Career 90th Percentile Salary',ascending=False)
print(sorted_df1['Undergraduate Major'].head())

17               Economics
22                 Finance
8     Chemical Engineering
37                    Math
44                 Physics
Name: Undergraduate Major, dtype: object

In [14]:
sorted_df2=df.sort_values('spread_midC',ascending=False)
print(sorted_df2['Undergraduate Major'].head())

17     Economics
22       Finance
37          Math
36     Marketing
42    Philosophy
Name: Undergraduate Major, dtype: object

In [16]:
df.groupby('Group').count()

,Undergraduate Major,Starting Median Salary,spread_midC,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16